; domain
;; Assignment D2-V1 - Basic Coffee Preparation
;; Q1: classical PDDL domain (STRIPS + typing)
;;
;; A fixed manipulator prepares coffee. The only object the robot actually
;; grasps is the cup; the water tap, powder dispenser and coffee machine
;; are fixed stations, so I model them as location capabilities instead of
;; separate objects. The contents of the cup go through a chain of states:
;;
;;    empty -> has-water -> has-powder -> coffee-ready
;;
;; The recipe order is never written explicitly anywhere. It comes out of
;; the preconditions: you cannot add powder before water, and the machine
;; refuses to brew unless both are in the cup.

(define (domain coffee-prep)

  (:requirements :strips :typing)

  (:types
    cup
    location
  )

  (:predicates
    ;; gripper state (the robot can hold one thing at a time)
    (gripper-empty)
    (holding ?c - cup)
    (at ?c - cup ?l - location)

    ;; what each fixed station can do
    (is-water-source ?l - location)
    (is-powder-source ?l - location)
    (is-machine ?l - location)

    ;; cup contents
    (empty ?c - cup)
    (has-water ?c - cup)
    (has-powder ?c - cup)
    (coffee-ready ?c - cup)
  )

  ;; pick the cup up; the gripper must be free
  (:action grasp
    :parameters (?c - cup ?l - location)
    :precondition (and (gripper-empty) (at ?c ?l))
    :effect (and (holding ?c)
                 (not (gripper-empty))
                 (not (at ?c ?l)))
  )

  ;; put the cup down at some location
  (:action place
    :parameters (?c - cup ?l - location)
    :precondition (holding ?c)
    :effect (and (at ?c ?l)
                 (gripper-empty)
                 (not (holding ?c)))
  )

  ;; Filling/brewing requires the cup PLACED at the right station and the
  ;; gripper free (the arm needs its hand to operate the tap or machine).
  ;; This is what makes grasp/place necessary steps and not decoration.

  (:action fill-water
    :parameters (?c - cup ?l - location)
    :precondition (and (at ?c ?l)
                       (is-water-source ?l)
                       (gripper-empty)
                       (empty ?c))         ; only an empty cup can be filled
    :effect (and (has-water ?c)
                 (not (empty ?c)))
  )

  (:action add-powder
    :parameters (?c - cup ?l - location)
    :precondition (and (at ?c ?l)
                       (is-powder-source ?l)
                       (gripper-empty)
                       (has-water ?c))     ; powder only after water
    :effect (has-powder ?c)
  )

  (:action brew-coffee
    :parameters (?c - cup ?l - location)
    :precondition (and (at ?c ?l)
                       (is-machine ?l)
                       (gripper-empty)
                       (has-water ?c)      ; machine needs both ingredients
                       (has-powder ?c))
    :effect (coffee-ready ?c)
  )
)

; problem
;; Q1, complex problem: each station is a different location and the cup
;; starts on a shelf. Every operation needs the cup placed at the right
;; station with the gripper free, so the robot has to grasp and place the
;; cup between stations. Expected plan length: 9.

(define (problem coffee-complex)
  (:domain coffee-prep)

  (:objects
    cup1             - cup
    shelf            - location
    water-source     - location
    powder-dispenser - location
    coffee-machine   - location
  )

  (:init
    (gripper-empty)
    (at cup1 shelf)
    (empty cup1)
    (is-water-source  water-source)
    (is-powder-source powder-dispenser)
    (is-machine       coffee-machine)
  )

  (:goal (coffee-ready cup1))
)

; plan
1. (grasp cup1 shelf)
   deleted: (gripper-empty) (at cup1 shelf)
   added: (holding cup1)
   goals met: 0 of 1
2. (place cup1 water-source)
   deleted: (holding cup1)
   added: (at cup1 water-source) (gripper-empty)
   goals met: 0 of 1
3. (fill-water cup1 water-source)
   deleted: (empty cup1)
   added: (has-water cup1)
   goals met: 0 of 1
4. (grasp cup1 water-source)
   deleted: (gripper-empty) (at cup1 water-source)
   added: (holding cup1)
   goals met: 0 of 1
5. (place cup1 powder-dispenser)
   deleted: (holding cup1)
   added: (at cup1 powder-dispenser) (gripper-empty)
   goals met: 0 of 1
6. (add-powder cup1 powder-dispenser)
   added: (has-powder cup1)
   goals met: 0 of 1
7. (grasp cup1 powder-dispenser)
   deleted: (gripper-empty) (at cup1 powder-dispenser)
   added: (holding cup1)
   goals met: 0 of 1
8. (place cup1 coffee-machine)
   deleted: (holding cup1)
   added: (at cup1 coffee-machine) (gripper-empty)
   goals met: 0 of 1
9. (brew-coffee cup1 coffee-machine)
   added: (coffee-ready cup1)
   goals met: 1 of 1
